Ramla-I/hal_agent/devices/nxp/s32k1xx/svd/s32k146.svd
        <register>
          <name>SC1P</name>
          <description>ADC Status and Control Register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000000</name>
                  <description>Exernal intput channel 0 is selected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000001</name>
                  <description>Exernal channel 1 is selected as input.</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000010</name>
                  <description>Exernal channel 2 is selected as input.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000011</name>
                  <description>Exernal channel 3 is selected as input.</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000100</name>
                  <description>Exernal channel 4 is selected as input.</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000101</name>
                  <description>Exernal channel 5 is selected as input.</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000110</name>
                  <description>Exernal channel 6 is selected as input.</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>000111</name>
                  <description>Exernal channel 7 is selected as input.</description>
                  <value>#111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001000</name>
                  <description>Exernal channel 8 is selected as input.</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>Exernal channel 9 is selected as input.</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001010</name>
                  <description>Exernal channel 10 is selected as input.</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001011</name>
                  <description>Exernal channel 11 is selected as input.</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001100</name>
                  <description>Exernal channel 12 is selected as input.</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001101</name>
                  <description>Exernal channel 13 is selected as input.</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001110</name>
                  <description>Exernal channel 14 is selected as input.</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001111</name>
                  <description>Exernal channel 15 is selected as input.</description>
                  <value>#1111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010101</name>
                  <description>Internal channel 0 is selected as input.</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010110</name>
                  <description>Internal channel 1 is selected as input.</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010111</name>
                  <description>Internal channel 2 is selected as input.</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011011</name>
                  <description>Band Gap</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011100</name>
                  <description>Internal channel 3 is selected as input.</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011101</name>
                  <description>VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011110</name>
                  <description>VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011111</name>
                  <description>Module is disabled</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100000</name>
                  <description>Internal channel 16 is selected as input.</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100001</name>
                  <description>Exernal channel 17 is selected as input.</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100010</name>
                  <description>Exernal channel 18 is selected as input.</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100011</name>
                  <description>Exernal channel 19 is selected as input.</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100100</name>
                  <description>Exernal channel 20 is selected as input.</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100101</name>
                  <description>Exernal channel 21 is selected as input.</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100110</name>
                  <description>Exernal channel 22 is selected as input.</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100111</name>
                  <description>Exernal channel 23 is selected as input.</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101000</name>
                  <description>Exernal channel 24 is selected as input.</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101001</name>
                  <description>Exernal channel 25 is selected as input.</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101010</name>
                  <description>Exernal channel 26 is selected as input.</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101011</name>
                  <description>Exernal channel 27 is selected as input.</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101100</name>
                  <description>Exernal channel 28 is selected as input.</description>
                  <value>#101100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101101</name>
                  <description>Exernal channel 29 is selected as input.</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101110</name>
                  <description>Exernal channel 30 is selected as input.</description>
                  <value>#101110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101111</name>
                  <description>Exernal channel 31 is selected as input.</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11xxxx</name>
                  <description>Module is disabled</description>
                  <value>#11xxxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Conversion complete interrupt is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Conversion complete interrupt is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COCO</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Conversion is not completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Conversion is completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>ADC Configuration Register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADICLK</name>
              <description>Input Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Alternate clock 1 (ADC_ALTCLK1)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Alternate clock 2 (ADC_ALTCLK2)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Alternate clock 3 (ADC_ALTCLK3)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Alternate clock 4 (ADC_ALTCLK4)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Conversion mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>8-bit conversion.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>12-bit conversion.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>10-bit conversion.</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIV</name>
              <description>Clock Divide Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>The divide ratio is 1 and the clock rate is input clock.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>The divide ratio is 2 and the clock rate is (input clock)/2.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>The divide ratio is 4 and the clock rate is (input clock)/4.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>The divide ratio is 8 and the clock rate is (input clock)/8.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRLTRG</name>
              <description>Clear Latch Trigger in Trigger Handler Block</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>ADC Configuration Register 2</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPLTS</name>
              <description>Sample Time Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RA</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RB</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RE</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RG</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RH</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RI</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RJ</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RK</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
